'''切片(Slice）操作符'''
L = ['Mackle','Mike','Mikle']
'''表示，从索引0开始取，直到索引3为止，但不包括索引3'''
L[0:3]  
'''支持倒数切片'''
L[-2:]  

L1 = list(range(100))
'''[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 
16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 
31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 
51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 
71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 
90, 91, 92, 93, 94, 95, 96, 97, 98, 99]'''
L1[:10] '''前10'''
L1[-10:] '''后10'''
L1[:10:2]  '''前10个数，每两个取一个'''
L1[::5] '''所有数，每5个取一个'''

L1[:]  '''复制列表'''


def trim(str):
    while str[:1] == ' ':
        str = str[1:]
    while str[-1:] == ' ':
        str = str[:-2]
    return str

if trim('hello  ') != 'hello':
    print('1测试失败!')
elif trim('  hello') != 'hello':
    print('2测试失败!')
elif trim('  hello  ') != 'hello':
    print('3测试失败!')
elif trim('  hello  world  ') != 'hello  world':
    print('4测试失败!')
elif trim('') != '':
    print('5测试失败!')
elif trim('    ') != '':
    print('6测试失败!')
else:
    print('7测试成功!')

str = ' nA B C D 1'
str[:1]
